
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITMETICA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 NUMERO1 PIC 9 VALUE 1.
           77 NUMERO2 PIC 9 value 2.
           77 RESULTADO PIC 99 VALUE 1.

       PROCEDURE DIVISION.
           DISPLAY "NUMERO1 = "NUMERO1.
           DISPLAY "NUMERO2 = "NUMERO2.
      * SUMA
      * RESULTADO = NUMERO1 + NUMERO2 + 5 + RESULTADO
           ADD NUMERO1 NUMERO2 5 TO RESULTADO.
           DISPLAY "ADD NUMERO1 NUMERO2 5 TO RESULTADO = "RESULTADO.
      * RESULTADO = NUMERO1 + NUMERO2 + 5
           ADD NUMERO1 NUMERO2 5 GIVING RESULTADO.
           DISPLAY "ADD NUMERO1 NUMERO2 5 GIVING RESULTADO = "RESULTADO.

           MOVE 1 TO RESULTADO
      * RESTA
      * RESULTADO = NUMERO1 - NUMERO2 - 5 - RESULTADO
           SUBTRACT NUMERO1 NUMERO2 5 FROM RESULTADO.
           DISPLAY "SUBTRACT NUMERO1 NUMERO2 5 FROM RESULTADO:"RESULTADO.
      * RESULTADO = NUMERO1 - 5 - NUMERO2
           SUBTRACT NUMERO1 5 FROM NUMERO2 GIVING RESULTADO.
           DISPLAY "SUBTRACT NUMERO1 5 FROM NUMERO2 GIVING RESULTADO = "RESULTADO.

           MOVE 0 TO RESULTADO.
      * MULTIPLICACION
      * RESULTADO = 5 * RESULTADO
           MULTIPLY 5 BY RESULTADO.
           DISPLAY "MULTIPLY 5 BY RESULTADO = "RESULTADO.
      * RESULTADO = 5 * NUMERO1
           MULTIPLY 5 BY NUMERO1 GIVING RESULTADO.
           DISPLAY "MULTIPLY 5 BY NUMERO1 GIVING RESULTADO = "RESULTADO.

           MOVE 10 TO RESULTADO.
      * DIVISION
      * RESULTADO = RESULTADO / 10
           DIVIDE 10 INTO RESULTADO.
           DISPLAY "DIVIDE 10 INTO RESULTADO = "RESULTADO.
      * RESULTADO = NUMERO1 / 7
           DIVIDE 7 INTO NUMERO1 GIVING RESULTADO.
           DISPLAY "DIVIDE 7 INTO NUMERO1 GIVING RESULTADO = "RESULTADO.

      * MIX
      * COMPUTE evalua una expresion aritmetica
           COMPUTE RESULTADO = (2 + 3) * 5.
           DISPLAY "RESULTADO = (2 + 3) * 5 = "RESULTADO.

           STOP RUN.
